app/views/shared/_user_info.html.erb

<span><%= link_to "ver mi perfil", current_user %></span>
<span><%= pluralize(current_user.microposts.count, "post") %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 10]]