app/controllers/account_activations_controller.rb

	def edit
		user = User.find_by(email: params[:email])
		if user && !user.activated? && user.authenticated?(:activation, params[:id])
			user.update_attribute(:activated,    true)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "carolin@a.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "activated_at" = ? WHERE "users"."id" = ?  [["updated_at", 2016-12-01 20:18:55 UTC], ["activated_at", 2016-12-01 20:18:55 UTC], ["id", 22]]