app/controllers/static_pages_controller.rb

  def home
  	if logged_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "microposts".* FROM "microposts" WHERE (user_id IN (10) OR user_id = 9) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships