app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
def index
  @users = User.paginate(page: params[:page], per_page: 6)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "inkling@splatoon.nintendo"], ["password_digest", "$2a$10$eU5zQ/zBKo6CQTy9jyf76OgUsjGAQ1rAQpsv5V0ctj05AS3OpWTfK"], ["updated_at", 2016-11-30 20:56:42 UTC], ["id", 5]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)